#ifndef BANKS_H
#define BANKS_H

#include <ultra64.h>

// technically everything in this struct is a void *, but it's so much easier this way
struct BankHeader {
	/* 0x0  */ u32 *geoBlockTable;
	/* 0x4  */ u32 *geoROMOffset;
	/* 0x8  */ u32 *imageBlockTable;
	/* 0xC  */ u32 *imageROMOffset;
	/* 0x10 */ u32 *animBlockTable;
	/* 0x14 */ u32 *animROMOffset;
	/* 0x18 */ u32 *miscBlockTable;
	/* 0x1C */ u32 *miscROMOffset;
};



extern u32 bank_0_index_1_geo_start[];
extern u32 bank_0_index_2_geo_start[];
extern u32 bank_0_index_3_geo_start[];
extern u32 bank_0_index_4_geo_start[];
extern u32 bank_0_index_5_geo_start[];
extern u32 bank_0_index_6_geo_start[];
extern u32 bank_0_index_7_geo_start[];
extern u32 bank_0_index_8_geo_start[];
extern u32 bank_0_index_9_geo_start[];
extern u32 bank_0_index_10_geo_start[];

extern u32 bank_0_index_1_geo_end[];
extern u32 bank_0_index_2_geo_end[];
extern u32 bank_0_index_3_geo_end[];
extern u32 bank_0_index_4_geo_end[];
extern u32 bank_0_index_5_geo_end[];
extern u32 bank_0_index_6_geo_end[];
extern u32 bank_0_index_7_geo_end[];
extern u32 bank_0_index_8_geo_end[];
extern u32 bank_0_index_9_geo_end[];
extern u32 bank_0_index_10_geo_end[];

extern u32 bank_0_index_1_image_start[];
extern u32 bank_0_index_2_image_start[];
extern u32 bank_0_index_3_image_start[];
extern u32 bank_0_index_4_image_start[];
